templates/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
                        xmlns:v2="http://katastr.cuzk.cz/ctios/types/v2.8">
                          <soapenv:Header> 
                              <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"> 
                                <wsse:UsernameToken wsu:Id="UsernameToken-3"> 
                                  <wsse:Username>$username</wsse:Username> 
                                  <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">$password</wsse:Password> 
                                </wsse:UsernameToken> 
                              </wsse:Security> 
                          </soapenv:Header> 
                          <soapenv:Body> 
                            <v2:CtiOsRequest> 
                                $posidents
                            </v2:CtiOsRequest> 
                          </soapenv:Body>
                        </soapenv:Envelope>